import { CommonModule } from '@angular/common';
import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-faq',
  imports:[CommonModule],
  templateUrl: './faq.component.html',
  styleUrls: ['./faq.component.css']
})
export class FaqComponent  {

 activeIndex: number | null = null;

  toggle(i: number) {
    this.activeIndex = this.activeIndex === i ? null : i;
  }

  faqs = [
    {
      q: 'كيف أعرف إذا كان المركز هو المكان الأنسب لطفلي؟',
      a: 'الاستكشاف هو الحل! ندعوكم لزيارة تجريبية حيث يقضي بطلكم وقتاً في بيئتنا، ونقوم بتقييم مدى انسجامه مع برامجنا المبتكرة قبل اتخاذ أي قرار. لا التزام، فقط اكتشاف.',
      icon: 'fa-solid fa-circle-question'
    },
    {
      q: 'ما هي المدة الزمنية من التقديم حتى الالتحاق الفعلي؟',
      a: 'نحن نقدر وقتكم. تستغرق الرحلة من التواصل الأول وحتى بدء الجلسات ما بين 7 إلى 10 أيام عمل، لضمان دقة التقييم وتصميم الخطة الفردية التي تليق بطموحاتكم.',
      icon: 'fa-solid fa-clock'
    },
    {
      q: 'هل يمكنني تعديل الخطة التربوية الفردية بعد بدئها؟',
      a: 'بالتأكيد! الخطة وثيقة حية وليست جامدة. نعقد اجتماعات دورية كل 3 أشهر أو حسب الحاجة لمراجعة الأهداف وتطويرها بناءً على سرعة تطور بطلكم.',
      icon: 'fa-solid fa-file-pen'
    },
    {
      q: 'ما هي المستندات المطلوبة لفتح الملف؟',
      a: 'قائمة بسيطة لرحلة عظيمة: الهوية الإماراتية، جواز السفر، صورة شخصية حديثة، التقرير الطبي الأحدث، وبطاقة أصحاب الهمم إن وجدت. الباقي نتولاه نحن في جلسة التقييم.',
      icon: 'fa-solid fa-folder-open'
    },
    {
      q: 'كيف يمكنني متابعة تطور طفلي؟',
      a: 'أنتم معنا في قلب الحدث! نوفر تقارير دورية شاملة واجتماعات منتظمة مع الفريق المتخصص لمناقشة التقدم المحرز وتعديل الأهداف — لأن شراكتكم معنا هي سر نجاح بطلكم.',
      icon: 'fa-solid fa-chart-line'
    },
    {
      q: 'ما هي أوقات الجلسات المتاحة؟',
      a: 'نوفر جلسات فردية بمدة 45 دقيقة في فترتين: صباحاً من 9:15 حتى 1:00 ظهراً، ومساءً من 4:15 حتى 8:00 مساءً — لتناسب جدول كل أسرة.',
      icon: 'fa-solid fa-calendar-check'
    },
  ];
}
