import { CommonModule } from '@angular/common';
import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-services',
  imports:[CommonModule],
  templateUrl: './services.component.html',
  styleUrls: ['./services.component.css']
})
export class ServicesComponent implements OnInit {

  constructor() { }

  ngOnInit() {
  }
 services = [
    {
      icon: 'fa-solid fa-book-open',
      title: 'التربية الخاصة',
      desc: 'برامج  تدريب وتأهيل مصممة خصيصاً لكل طالب تُعدّ ضمن خطة تأهيلية  فردية (IEP) شاملة. نحرص على تطوير المهارات الشخصية والمعرفية بأسلوب يراعي قدرات الطفل وإيقاعه الخاص في التعلم.',
      price: '250 درهم / جلسة',
      tags: ['45 دقيقة', 'خطة فردية', 'متابعة مستمرة']
    },
    {
      icon: 'fa-solid fa-comments',
      title: 'تأهيل اضطرابات اللغة والكلام',
      desc: 'نعمل على تقييم وتأهيل اضطرابات النطق واللغة والتواصل الاجتماعي والإدراكي. يتدرب الطفل على مهارات التعبير والفهم والتفاعل مع الآخرين بأساليب علمية معتمدة دولياً.',
      price: '250 درهم / جلسة',
      tags: ['45 دقيقة', 'نطق', 'لغة', 'تواصل']
    },
    {
      icon: 'fa-solid fa-brain',
      title: 'تعديل السلوك (ABA)',
      desc: 'تحليل السلوك التطبيقي (ABA) هو البرنامج  الأكثر فاعلية وفق الأبحاث العلمية. نستخدمه لفهم سلوكيات الطفل وتحسينها بشكل موضوعي وقابل للقياس مع تعزيز المهارات الاجتماعية والتكيفية.',
      price: '250 درهم / جلسة',
      tags: ['45 دقيقة',  'سلوك تطبيقي', 'مثبت علمياً']
    },
    {
      icon: 'fa-solid fa-seedling',
      title: 'التدخل المبكر',
      desc: 'تشير الأبحاث إلى أن التدخل المبكر المكثف في سن 2-4 سنوات يُحقق أفضل النتائج لنمو الطفل. برامجنا المتخصصة تستهدف هذه المرحلة الذهبية لبناء أسس تطورية سليمة.',
      price: '250 درهم / جلسة',
      tags: ['2-6 سنوات', 'تدخل مبكر', 'نتائج مثبتة']
    },
    {
      icon: 'fa-solid fa-people-arrows',
      title: 'الدمج المجتمعي',
      desc: 'نساعد الطفل على المشاركة في الأنشطة المجتمعية بأسلوب يُعزز تفاعل ومساندة الأسرة والطفل خلال مراحل الدمج المجتمعي بشكل صحي ومستقل، ونعمل على تنمية مهارات السلوك المناسب والتفاعل الاجتماعي، مع فتح آفاق جديدة للنمو والتطور.',
      price: '250 درهم / جلسة',
      tags: ['مهارات اجتماعية', 'استقلالية', 'دمج']
    },
    {
      icon: 'fa-solid fa-hand-holding-heart',
      title: 'دعم ومساندة الأسرة خلال رحلة تأهيل الطفل',
      desc: 'الأسرة شريك أساسي في رحلة التأهيل. تثبت الدراسات أن مشاركة الوالدين في البرنامج التأهيلي تُحقق نتائج أفضل بكثير. نُدرّب الأسرة على تطبيق البرنامج في البيئة المنزلية ودعم تقدم الطفل يومياً.',
      price: '250 درهم / جلسة',
      tags: ['تدريب أسري', 'برنامج منزلي', 'نتائج أفضل']
    },
  ];
}
